# IsSwitchboard Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalEquipment..::..IsSwitchboard Property
ElectricalEquipment Class See Also
---
The electrical equipment is a switchboard or not. This property returns true if the electrical equipment is a switchboard.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool IsSwitchboard { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSwitchboard As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSwitchboard {
	bool get ();
}
```

# See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace